GopalSaraf/Practicals/PSDL/include/proc/pic18f26q10.h
// Register: CLC5POL
#define CLC5POL CLC5POL
extern volatile unsigned char           CLC5POL             __at(0xE50);
#ifndef _LIB_BUILD
asm("CLC5POL equ 0E50h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1POL                  :1;
        unsigned G2POL                  :1;
        unsigned G3POL                  :1;
        unsigned G4POL                  :1;
        unsigned                        :3;
        unsigned POL                    :1;
    };
    struct {
        unsigned LC5G1POL               :1;
        unsigned LC5G2POL               :1;
        unsigned LC5G3POL               :1;
        unsigned LC5G4POL               :1;
        unsigned                        :3;
        unsigned LC5POL                 :1;
    };
} CLC5POLbits_t;
extern volatile CLC5POLbits_t CLC5POLbits __at(0xE50);
// bitfield macros
#define _CLC5POL_G1POL_POSN                                 0x0
#define _CLC5POL_G1POL_POSITION                             0x0
#define _CLC5POL_G1POL_SIZE                                 0x1
#define _CLC5POL_G1POL_LENGTH                               0x1
#define _CLC5POL_G1POL_MASK                                 0x1
#define _CLC5POL_G2POL_POSN                                 0x1
#define _CLC5POL_G2POL_POSITION                             0x1
#define _CLC5POL_G2POL_SIZE                                 0x1
#define _CLC5POL_G2POL_LENGTH                               0x1
#define _CLC5POL_G2POL_MASK                                 0x2
#define _CLC5POL_G3POL_POSN                                 0x2
#define _CLC5POL_G3POL_POSITION                             0x2
#define _CLC5POL_G3POL_SIZE                                 0x1
#define _CLC5POL_G3POL_LENGTH                               0x1
#define _CLC5POL_G3POL_MASK                                 0x4
#define _CLC5POL_G4POL_POSN                                 0x3
#define _CLC5POL_G4POL_POSITION                             0x3
#define _CLC5POL_G4POL_SIZE                                 0x1
#define _CLC5POL_G4POL_LENGTH                               0x1
#define _CLC5POL_G4POL_MASK                                 0x8
#define _CLC5POL_POL_POSN                                   0x7
#define _CLC5POL_POL_POSITION                               0x7
#define _CLC5POL_POL_SIZE                                   0x1
#define _CLC5POL_POL_LENGTH                                 0x1
#define _CLC5POL_POL_MASK                                   0x80
#define _CLC5POL_LC5G1POL_POSN                              0x0
#define _CLC5POL_LC5G1POL_POSITION                          0x0
#define _CLC5POL_LC5G1POL_SIZE                              0x1
#define _CLC5POL_LC5G1POL_LENGTH                            0x1
#define _CLC5POL_LC5G1POL_MASK                              0x1
#define _CLC5POL_LC5G2POL_POSN                              0x1
#define _CLC5POL_LC5G2POL_POSITION                          0x1
#define _CLC5POL_LC5G2POL_SIZE                              0x1
#define _CLC5POL_LC5G2POL_LENGTH                            0x1
#define _CLC5POL_LC5G2POL_MASK                              0x2
#define _CLC5POL_LC5G3POL_POSN                              0x2
#define _CLC5POL_LC5G3POL_POSITION                          0x2
#define _CLC5POL_LC5G3POL_SIZE                              0x1
#define _CLC5POL_LC5G3POL_LENGTH                            0x1
#define _CLC5POL_LC5G3POL_MASK                              0x4
#define _CLC5POL_LC5G4POL_POSN                              0x3
#define _CLC5POL_LC5G4POL_POSITION                          0x3
#define _CLC5POL_LC5G4POL_SIZE                              0x1
#define _CLC5POL_LC5G4POL_LENGTH                            0x1
#define _CLC5POL_LC5G4POL_MASK                              0x8
#define _CLC5POL_LC5POL_POSN                                0x7
#define _CLC5POL_LC5POL_POSITION                            0x7
#define _CLC5POL_LC5POL_SIZE                                0x1
#define _CLC5POL_LC5POL_LENGTH                              0x1
#define _CLC5POL_LC5POL_MASK                                0x80

// Register: CLC5SEL0
#define CLC5SEL0 CLC5SEL0
extern volatile unsigned char           CLC5SEL0            __at(0xE51);
#ifndef _LIB_BUILD
asm("CLC5SEL0 equ 0E51h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned D1S                    :8;
    };
    struct {
        unsigned LC5D1S                 :8;
    };
    struct {
        unsigned D1S0                   :1;
        unsigned D1S1                   :1;
        unsigned D1S2                   :1;
        unsigned D1S3                   :1;
        unsigned D1S4                   :1;
        unsigned D1S5                   :1;
        unsigned D1S6                   :1;
        unsigned D1S7                   :1;
    };
    struct {
        unsigned LC5D1S0                :1;
        unsigned LC5D1S1                :1;
        unsigned LC5D1S2                :1;
        unsigned LC5D1S3                :1;
        unsigned LC5D1S4                :1;
        unsigned LC5D1S5                :1;
        unsigned LC5D1S6                :1;
        unsigned LC5D1S7                :1;
    };
} CLC5SEL0bits_t;
extern volatile CLC5SEL0bits_t CLC5SEL0bits __at(0xE51);
// bitfield macros
#define _CLC5SEL0_D1S_POSN                                  0x0
#define _CLC5SEL0_D1S_POSITION                              0x0
#define _CLC5SEL0_D1S_SIZE                                  0x8
#define _CLC5SEL0_D1S_LENGTH                                0x8
#define _CLC5SEL0_D1S_MASK                                  0xFF
#define _CLC5SEL0_LC5D1S_POSN                               0x0
#define _CLC5SEL0_LC5D1S_POSITION                           0x0
#define _CLC5SEL0_LC5D1S_SIZE                               0x8
#define _CLC5SEL0_LC5D1S_LENGTH                             0x8
#define _CLC5SEL0_LC5D1S_MASK                               0xFF
#define _CLC5SEL0_D1S0_POSN                                 0x0
#define _CLC5SEL0_D1S0_POSITION                             0x0
#define _CLC5SEL0_D1S0_SIZE                                 0x1
#define _CLC5SEL0_D1S0_LENGTH                               0x1
#define _CLC5SEL0_D1S0_MASK                                 0x1
#define _CLC5SEL0_D1S1_POSN                                 0x1
#define _CLC5SEL0_D1S1_POSITION                             0x1
#define _CLC5SEL0_D1S1_SIZE                                 0x1
#define _CLC5SEL0_D1S1_LENGTH                               0x1
#define _CLC5SEL0_D1S1_MASK                                 0x2
#define _CLC5SEL0_D1S2_POSN                                 0x2
#define _CLC5SEL0_D1S2_POSITION                             0x2
#define _CLC5SEL0_D1S2_SIZE                                 0x1
#define _CLC5SEL0_D1S2_LENGTH                               0x1
#define _CLC5SEL0_D1S2_MASK                                 0x4
#define _CLC5SEL0_D1S3_POSN                                 0x3
#define _CLC5SEL0_D1S3_POSITION                             0x3
#define _CLC5SEL0_D1S3_SIZE                                 0x1
#define _CLC5SEL0_D1S3_LENGTH                               0x1
#define _CLC5SEL0_D1S3_MASK                                 0x8
#define _CLC5SEL0_D1S4_POSN                                 0x4
#define _CLC5SEL0_D1S4_POSITION                             0x4
#define _CLC5SEL0_D1S4_SIZE                                 0x1
#define _CLC5SEL0_D1S4_LENGTH                               0x1
#define _CLC5SEL0_D1S4_MASK                                 0x10
#define _CLC5SEL0_D1S5_POSN                                 0x5
#define _CLC5SEL0_D1S5_POSITION                             0x5
#define _CLC5SEL0_D1S5_SIZE                                 0x1
#define _CLC5SEL0_D1S5_LENGTH                               0x1
#define _CLC5SEL0_D1S5_MASK                                 0x20
#define _CLC5SEL0_D1S6_POSN                                 0x6
#define _CLC5SEL0_D1S6_POSITION                             0x6
#define _CLC5SEL0_D1S6_SIZE                                 0x1
#define _CLC5SEL0_D1S6_LENGTH                               0x1
#define _CLC5SEL0_D1S6_MASK                                 0x40
#define _CLC5SEL0_D1S7_POSN                                 0x7
#define _CLC5SEL0_D1S7_POSITION                             0x7
#define _CLC5SEL0_D1S7_SIZE                                 0x1
#define _CLC5SEL0_D1S7_LENGTH                               0x1
#define _CLC5SEL0_D1S7_MASK                                 0x80
#define _CLC5SEL0_LC5D1S0_POSN                              0x0
#define _CLC5SEL0_LC5D1S0_POSITION                          0x0
#define _CLC5SEL0_LC5D1S0_SIZE                              0x1
#define _CLC5SEL0_LC5D1S0_LENGTH                            0x1
#define _CLC5SEL0_LC5D1S0_MASK                              0x1
#define _CLC5SEL0_LC5D1S1_POSN                              0x1
#define _CLC5SEL0_LC5D1S1_POSITION                          0x1
#define _CLC5SEL0_LC5D1S1_SIZE                              0x1
#define _CLC5SEL0_LC5D1S1_LENGTH                            0x1
#define _CLC5SEL0_LC5D1S1_MASK                              0x2
#define _CLC5SEL0_LC5D1S2_POSN                              0x2
#define _CLC5SEL0_LC5D1S2_POSITION                          0x2
#define _CLC5SEL0_LC5D1S2_SIZE                              0x1
#define _CLC5SEL0_LC5D1S2_LENGTH                            0x1
#define _CLC5SEL0_LC5D1S2_MASK                              0x4
#define _CLC5SEL0_LC5D1S3_POSN                              0x3
#define _CLC5SEL0_LC5D1S3_POSITION                          0x3
#define _CLC5SEL0_LC5D1S3_SIZE                              0x1
#define _CLC5SEL0_LC5D1S3_LENGTH                            0x1
#define _CLC5SEL0_LC5D1S3_MASK                              0x8
#define _CLC5SEL0_LC5D1S4_POSN                              0x4
#define _CLC5SEL0_LC5D1S4_POSITION                          0x4
#define _CLC5SEL0_LC5D1S4_SIZE                              0x1
#define _CLC5SEL0_LC5D1S4_LENGTH                            0x1
#define _CLC5SEL0_LC5D1S4_MASK                              0x10
#define _CLC5SEL0_LC5D1S5_POSN                              0x5
#define _CLC5SEL0_LC5D1S5_POSITION                          0x5
#define _CLC5SEL0_LC5D1S5_SIZE                              0x1
#define _CLC5SEL0_LC5D1S5_LENGTH                            0x1
#define _CLC5SEL0_LC5D1S5_MASK                              0x20
#define _CLC5SEL0_LC5D1S6_POSN                              0x6
#define _CLC5SEL0_LC5D1S6_POSITION                          0x6
#define _CLC5SEL0_LC5D1S6_SIZE                              0x1
#define _CLC5SEL0_LC5D1S6_LENGTH                            0x1
#define _CLC5SEL0_LC5D1S6_MASK                              0x40
#define _CLC5SEL0_LC5D1S7_POSN                              0x7
#define _CLC5SEL0_LC5D1S7_POSITION                          0x7
#define _CLC5SEL0_LC5D1S7_SIZE                              0x1
#define _CLC5SEL0_LC5D1S7_LENGTH                            0x1
#define _CLC5SEL0_LC5D1S7_MASK                              0x80

// Register: CLC5SEL1
#define CLC5SEL1 CLC5SEL1
extern volatile unsigned char           CLC5SEL1            __at(0xE52);
#ifndef _LIB_BUILD
asm("CLC5SEL1 equ 0E52h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned D2S                    :8;
    };
    struct {
        unsigned LC5D2S                 :8;
    };
    struct {
        unsigned D2S0                   :1;
        unsigned D2S1                   :1;
        unsigned D2S2                   :1;
        unsigned D2S3                   :1;
        unsigned D2S4                   :1;
        unsigned D2S5                   :1;
        unsigned D2S6                   :1;
        unsigned D2S7                   :1;
    };
    struct {
        unsigned LC5D2S0                :1;
        unsigned LC5D2S1                :1;
        unsigned LC5D2S2                :1;
        unsigned LC5D2S3                :1;
        unsigned LC5D2S4                :1;
        unsigned LC5D2S5                :1;
        unsigned LC5D2S6                :1;
        unsigned LC5D2S7                :1;
    };
} CLC5SEL1bits_t;
