GopalSaraf/Practicals/PSDL/include/proc/pic18f26q10.h
extern volatile CLC8SEL3bits_t CLC8SEL3bits __at(0xE72);
// bitfield macros
#define _CLC8SEL3_D4S_POSN                                  0x0
#define _CLC8SEL3_D4S_POSITION                              0x0
#define _CLC8SEL3_D4S_SIZE                                  0x8
#define _CLC8SEL3_D4S_LENGTH                                0x8
#define _CLC8SEL3_D4S_MASK                                  0xFF
#define _CLC8SEL3_LC8D4S_POSN                               0x0
#define _CLC8SEL3_LC8D4S_POSITION                           0x0
#define _CLC8SEL3_LC8D4S_SIZE                               0x8
#define _CLC8SEL3_LC8D4S_LENGTH                             0x8
#define _CLC8SEL3_LC8D4S_MASK                               0xFF
#define _CLC8SEL3_D4S0_POSN                                 0x0
#define _CLC8SEL3_D4S0_POSITION                             0x0
#define _CLC8SEL3_D4S0_SIZE                                 0x1
#define _CLC8SEL3_D4S0_LENGTH                               0x1
#define _CLC8SEL3_D4S0_MASK                                 0x1
#define _CLC8SEL3_D4S1_POSN                                 0x1
#define _CLC8SEL3_D4S1_POSITION                             0x1
#define _CLC8SEL3_D4S1_SIZE                                 0x1
#define _CLC8SEL3_D4S1_LENGTH                               0x1
#define _CLC8SEL3_D4S1_MASK                                 0x2
#define _CLC8SEL3_D4S2_POSN                                 0x2
#define _CLC8SEL3_D4S2_POSITION                             0x2
#define _CLC8SEL3_D4S2_SIZE                                 0x1
#define _CLC8SEL3_D4S2_LENGTH                               0x1
#define _CLC8SEL3_D4S2_MASK                                 0x4
#define _CLC8SEL3_D4S3_POSN                                 0x3
#define _CLC8SEL3_D4S3_POSITION                             0x3
#define _CLC8SEL3_D4S3_SIZE                                 0x1
#define _CLC8SEL3_D4S3_LENGTH                               0x1
#define _CLC8SEL3_D4S3_MASK                                 0x8
#define _CLC8SEL3_D4S4_POSN                                 0x4
#define _CLC8SEL3_D4S4_POSITION                             0x4
#define _CLC8SEL3_D4S4_SIZE                                 0x1
#define _CLC8SEL3_D4S4_LENGTH                               0x1
#define _CLC8SEL3_D4S4_MASK                                 0x10
#define _CLC8SEL3_D4S5_POSN                                 0x5
#define _CLC8SEL3_D4S5_POSITION                             0x5
#define _CLC8SEL3_D4S5_SIZE                                 0x1
#define _CLC8SEL3_D4S5_LENGTH                               0x1
#define _CLC8SEL3_D4S5_MASK                                 0x20
#define _CLC8SEL3_D4S6_POSN                                 0x6
#define _CLC8SEL3_D4S6_POSITION                             0x6
#define _CLC8SEL3_D4S6_SIZE                                 0x1
#define _CLC8SEL3_D4S6_LENGTH                               0x1
#define _CLC8SEL3_D4S6_MASK                                 0x40
#define _CLC8SEL3_D4S7_POSN                                 0x7
#define _CLC8SEL3_D4S7_POSITION                             0x7
#define _CLC8SEL3_D4S7_SIZE                                 0x1
#define _CLC8SEL3_D4S7_LENGTH                               0x1
#define _CLC8SEL3_D4S7_MASK                                 0x80
#define _CLC8SEL3_LC8D4S0_POSN                              0x0
#define _CLC8SEL3_LC8D4S0_POSITION                          0x0
#define _CLC8SEL3_LC8D4S0_SIZE                              0x1
#define _CLC8SEL3_LC8D4S0_LENGTH                            0x1
#define _CLC8SEL3_LC8D4S0_MASK                              0x1
#define _CLC8SEL3_LC8D4S1_POSN                              0x1
#define _CLC8SEL3_LC8D4S1_POSITION                          0x1
#define _CLC8SEL3_LC8D4S1_SIZE                              0x1
#define _CLC8SEL3_LC8D4S1_LENGTH                            0x1
#define _CLC8SEL3_LC8D4S1_MASK                              0x2
#define _CLC8SEL3_LC8D4S2_POSN                              0x2
#define _CLC8SEL3_LC8D4S2_POSITION                          0x2
#define _CLC8SEL3_LC8D4S2_SIZE                              0x1
#define _CLC8SEL3_LC8D4S2_LENGTH                            0x1
#define _CLC8SEL3_LC8D4S2_MASK                              0x4
#define _CLC8SEL3_LC8D4S3_POSN                              0x3
#define _CLC8SEL3_LC8D4S3_POSITION                          0x3
#define _CLC8SEL3_LC8D4S3_SIZE                              0x1
#define _CLC8SEL3_LC8D4S3_LENGTH                            0x1
#define _CLC8SEL3_LC8D4S3_MASK                              0x8
#define _CLC8SEL3_LC8D4S4_POSN                              0x4
#define _CLC8SEL3_LC8D4S4_POSITION                          0x4
#define _CLC8SEL3_LC8D4S4_SIZE                              0x1
#define _CLC8SEL3_LC8D4S4_LENGTH                            0x1
#define _CLC8SEL3_LC8D4S4_MASK                              0x10
#define _CLC8SEL3_LC8D4S5_POSN                              0x5
#define _CLC8SEL3_LC8D4S5_POSITION                          0x5
#define _CLC8SEL3_LC8D4S5_SIZE                              0x1
#define _CLC8SEL3_LC8D4S5_LENGTH                            0x1
#define _CLC8SEL3_LC8D4S5_MASK                              0x20
#define _CLC8SEL3_LC8D4S6_POSN                              0x6
#define _CLC8SEL3_LC8D4S6_POSITION                          0x6
#define _CLC8SEL3_LC8D4S6_SIZE                              0x1
#define _CLC8SEL3_LC8D4S6_LENGTH                            0x1
#define _CLC8SEL3_LC8D4S6_MASK                              0x40
#define _CLC8SEL3_LC8D4S7_POSN                              0x7
#define _CLC8SEL3_LC8D4S7_POSITION                          0x7
#define _CLC8SEL3_LC8D4S7_SIZE                              0x1
#define _CLC8SEL3_LC8D4S7_LENGTH                            0x1
#define _CLC8SEL3_LC8D4S7_MASK                              0x80

// Register: CLC8GLS0
#define CLC8GLS0 CLC8GLS0
extern volatile unsigned char           CLC8GLS0            __at(0xE73);
#ifndef _LIB_BUILD
asm("CLC8GLS0 equ 0E73h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1D1N                  :1;
        unsigned G1D1T                  :1;
        unsigned G1D2N                  :1;
        unsigned G1D2T                  :1;
        unsigned G1D3N                  :1;
        unsigned G1D3T                  :1;
        unsigned G1D4N                  :1;
        unsigned G1D4T                  :1;
    };
    struct {
        unsigned LC8G1D1N               :1;
        unsigned LC8G1D1T               :1;
        unsigned LC8G1D2N               :1;
        unsigned LC8G1D2T               :1;
        unsigned LC8G1D3N               :1;
        unsigned LC8G1D3T               :1;
        unsigned LC8G1D4N               :1;
        unsigned LC8G1D4T               :1;
    };
} CLC8GLS0bits_t;
extern volatile CLC8GLS0bits_t CLC8GLS0bits __at(0xE73);
// bitfield macros
#define _CLC8GLS0_G1D1N_POSN                                0x0
#define _CLC8GLS0_G1D1N_POSITION                            0x0
#define _CLC8GLS0_G1D1N_SIZE                                0x1
#define _CLC8GLS0_G1D1N_LENGTH                              0x1
#define _CLC8GLS0_G1D1N_MASK                                0x1
#define _CLC8GLS0_G1D1T_POSN                                0x1
#define _CLC8GLS0_G1D1T_POSITION                            0x1
#define _CLC8GLS0_G1D1T_SIZE                                0x1
#define _CLC8GLS0_G1D1T_LENGTH                              0x1
#define _CLC8GLS0_G1D1T_MASK                                0x2
#define _CLC8GLS0_G1D2N_POSN                                0x2
#define _CLC8GLS0_G1D2N_POSITION                            0x2
#define _CLC8GLS0_G1D2N_SIZE                                0x1
#define _CLC8GLS0_G1D2N_LENGTH                              0x1
#define _CLC8GLS0_G1D2N_MASK                                0x4
#define _CLC8GLS0_G1D2T_POSN                                0x3
#define _CLC8GLS0_G1D2T_POSITION                            0x3
#define _CLC8GLS0_G1D2T_SIZE                                0x1
#define _CLC8GLS0_G1D2T_LENGTH                              0x1
#define _CLC8GLS0_G1D2T_MASK                                0x8
#define _CLC8GLS0_G1D3N_POSN                                0x4
#define _CLC8GLS0_G1D3N_POSITION                            0x4
#define _CLC8GLS0_G1D3N_SIZE                                0x1
#define _CLC8GLS0_G1D3N_LENGTH                              0x1
#define _CLC8GLS0_G1D3N_MASK                                0x10
#define _CLC8GLS0_G1D3T_POSN                                0x5
#define _CLC8GLS0_G1D3T_POSITION                            0x5
#define _CLC8GLS0_G1D3T_SIZE                                0x1
#define _CLC8GLS0_G1D3T_LENGTH                              0x1
#define _CLC8GLS0_G1D3T_MASK                                0x20
#define _CLC8GLS0_G1D4N_POSN                                0x6
#define _CLC8GLS0_G1D4N_POSITION                            0x6
#define _CLC8GLS0_G1D4N_SIZE                                0x1
#define _CLC8GLS0_G1D4N_LENGTH                              0x1
#define _CLC8GLS0_G1D4N_MASK                                0x40
#define _CLC8GLS0_G1D4T_POSN                                0x7
#define _CLC8GLS0_G1D4T_POSITION                            0x7
#define _CLC8GLS0_G1D4T_SIZE                                0x1
#define _CLC8GLS0_G1D4T_LENGTH                              0x1
#define _CLC8GLS0_G1D4T_MASK                                0x80
#define _CLC8GLS0_LC8G1D1N_POSN                             0x0
#define _CLC8GLS0_LC8G1D1N_POSITION                         0x0
#define _CLC8GLS0_LC8G1D1N_SIZE                             0x1
#define _CLC8GLS0_LC8G1D1N_LENGTH                           0x1
#define _CLC8GLS0_LC8G1D1N_MASK                             0x1
#define _CLC8GLS0_LC8G1D1T_POSN                             0x1
#define _CLC8GLS0_LC8G1D1T_POSITION                         0x1
#define _CLC8GLS0_LC8G1D1T_SIZE                             0x1
#define _CLC8GLS0_LC8G1D1T_LENGTH                           0x1
#define _CLC8GLS0_LC8G1D1T_MASK                             0x2
#define _CLC8GLS0_LC8G1D2N_POSN                             0x2
#define _CLC8GLS0_LC8G1D2N_POSITION                         0x2
#define _CLC8GLS0_LC8G1D2N_SIZE                             0x1
#define _CLC8GLS0_LC8G1D2N_LENGTH                           0x1
#define _CLC8GLS0_LC8G1D2N_MASK                             0x4
#define _CLC8GLS0_LC8G1D2T_POSN                             0x3
#define _CLC8GLS0_LC8G1D2T_POSITION                         0x3
#define _CLC8GLS0_LC8G1D2T_SIZE                             0x1
#define _CLC8GLS0_LC8G1D2T_LENGTH                           0x1
#define _CLC8GLS0_LC8G1D2T_MASK                             0x8
#define _CLC8GLS0_LC8G1D3N_POSN                             0x4
#define _CLC8GLS0_LC8G1D3N_POSITION                         0x4
#define _CLC8GLS0_LC8G1D3N_SIZE                             0x1
#define _CLC8GLS0_LC8G1D3N_LENGTH                           0x1
#define _CLC8GLS0_LC8G1D3N_MASK                             0x10
#define _CLC8GLS0_LC8G1D3T_POSN                             0x5
#define _CLC8GLS0_LC8G1D3T_POSITION                         0x5
#define _CLC8GLS0_LC8G1D3T_SIZE                             0x1
#define _CLC8GLS0_LC8G1D3T_LENGTH                           0x1
#define _CLC8GLS0_LC8G1D3T_MASK                             0x20
#define _CLC8GLS0_LC8G1D4N_POSN                             0x6
#define _CLC8GLS0_LC8G1D4N_POSITION                         0x6
#define _CLC8GLS0_LC8G1D4N_SIZE                             0x1
#define _CLC8GLS0_LC8G1D4N_LENGTH                           0x1
#define _CLC8GLS0_LC8G1D4N_MASK                             0x40
#define _CLC8GLS0_LC8G1D4T_POSN                             0x7
#define _CLC8GLS0_LC8G1D4T_POSITION                         0x7
#define _CLC8GLS0_LC8G1D4T_SIZE                             0x1
#define _CLC8GLS0_LC8G1D4T_LENGTH                           0x1
#define _CLC8GLS0_LC8G1D4T_MASK                             0x80

// Register: CLC8GLS1
#define CLC8GLS1 CLC8GLS1
extern volatile unsigned char           CLC8GLS1            __at(0xE74);
#ifndef _LIB_BUILD
asm("CLC8GLS1 equ 0E74h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G2D1N                  :1;
        unsigned G2D1T                  :1;
        unsigned G2D2N                  :1;
        unsigned G2D2T                  :1;
        unsigned G2D3N                  :1;
        unsigned G2D3T                  :1;
        unsigned G2D4N                  :1;
        unsigned G2D4T                  :1;
    };
    struct {
        unsigned LC8G2D1N               :1;
        unsigned LC8G2D1T               :1;
        unsigned LC8G2D2N               :1;
        unsigned LC8G2D2T               :1;
        unsigned LC8G2D3N               :1;
        unsigned LC8G2D3T               :1;
        unsigned LC8G2D4N               :1;
        unsigned LC8G2D4T               :1;
    };
} CLC8GLS1bits_t;
extern volatile CLC8GLS1bits_t CLC8GLS1bits __at(0xE74);
// bitfield macros
#define _CLC8GLS1_G2D1N_POSN                                0x0
#define _CLC8GLS1_G2D1N_POSITION                            0x0
#define _CLC8GLS1_G2D1N_SIZE                                0x1
#define _CLC8GLS1_G2D1N_LENGTH                              0x1
#define _CLC8GLS1_G2D1N_MASK                                0x1
#define _CLC8GLS1_G2D1T_POSN                                0x1
#define _CLC8GLS1_G2D1T_POSITION                            0x1
#define _CLC8GLS1_G2D1T_SIZE                                0x1
#define _CLC8GLS1_G2D1T_LENGTH                              0x1
#define _CLC8GLS1_G2D1T_MASK                                0x2
#define _CLC8GLS1_G2D2N_POSN                                0x2
#define _CLC8GLS1_G2D2N_POSITION                            0x2
#define _CLC8GLS1_G2D2N_SIZE                                0x1
#define _CLC8GLS1_G2D2N_LENGTH                              0x1
#define _CLC8GLS1_G2D2N_MASK                                0x4
#define _CLC8GLS1_G2D2T_POSN                                0x3
#define _CLC8GLS1_G2D2T_POSITION                            0x3
#define _CLC8GLS1_G2D2T_SIZE                                0x1
#define _CLC8GLS1_G2D2T_LENGTH                              0x1
#define _CLC8GLS1_G2D2T_MASK                                0x8
#define _CLC8GLS1_G2D3N_POSN                                0x4
#define _CLC8GLS1_G2D3N_POSITION                            0x4
#define _CLC8GLS1_G2D3N_SIZE                                0x1
#define _CLC8GLS1_G2D3N_LENGTH                              0x1
#define _CLC8GLS1_G2D3N_MASK                                0x10
#define _CLC8GLS1_G2D3T_POSN                                0x5
#define _CLC8GLS1_G2D3T_POSITION                            0x5
#define _CLC8GLS1_G2D3T_SIZE                                0x1
#define _CLC8GLS1_G2D3T_LENGTH                              0x1
#define _CLC8GLS1_G2D3T_MASK                                0x20
#define _CLC8GLS1_G2D4N_POSN                                0x6
#define _CLC8GLS1_G2D4N_POSITION                            0x6
#define _CLC8GLS1_G2D4N_SIZE                                0x1
#define _CLC8GLS1_G2D4N_LENGTH                              0x1
#define _CLC8GLS1_G2D4N_MASK                                0x40
#define _CLC8GLS1_G2D4T_POSN                                0x7
#define _CLC8GLS1_G2D4T_POSITION                            0x7
#define _CLC8GLS1_G2D4T_SIZE                                0x1
#define _CLC8GLS1_G2D4T_LENGTH                              0x1
#define _CLC8GLS1_G2D4T_MASK                                0x80
#define _CLC8GLS1_LC8G2D1N_POSN                             0x0
#define _CLC8GLS1_LC8G2D1N_POSITION                         0x0
#define _CLC8GLS1_LC8G2D1N_SIZE                             0x1
#define _CLC8GLS1_LC8G2D1N_LENGTH                           0x1
#define _CLC8GLS1_LC8G2D1N_MASK                             0x1
#define _CLC8GLS1_LC8G2D1T_POSN                             0x1
#define _CLC8GLS1_LC8G2D1T_POSITION                         0x1
#define _CLC8GLS1_LC8G2D1T_SIZE                             0x1
#define _CLC8GLS1_LC8G2D1T_LENGTH                           0x1
#define _CLC8GLS1_LC8G2D1T_MASK                             0x2
#define _CLC8GLS1_LC8G2D2N_POSN                             0x2
#define _CLC8GLS1_LC8G2D2N_POSITION                         0x2
#define _CLC8GLS1_LC8G2D2N_SIZE                             0x1
#define _CLC8GLS1_LC8G2D2N_LENGTH                           0x1
#define _CLC8GLS1_LC8G2D2N_MASK                             0x4
#define _CLC8GLS1_LC8G2D2T_POSN                             0x3
#define _CLC8GLS1_LC8G2D2T_POSITION                         0x3
#define _CLC8GLS1_LC8G2D2T_SIZE                             0x1
#define _CLC8GLS1_LC8G2D2T_LENGTH                           0x1
#define _CLC8GLS1_LC8G2D2T_MASK                             0x8
#define _CLC8GLS1_LC8G2D3N_POSN                             0x4
#define _CLC8GLS1_LC8G2D3N_POSITION                         0x4
#define _CLC8GLS1_LC8G2D3N_SIZE                             0x1
#define _CLC8GLS1_LC8G2D3N_LENGTH                           0x1
#define _CLC8GLS1_LC8G2D3N_MASK                             0x10
#define _CLC8GLS1_LC8G2D3T_POSN                             0x5
#define _CLC8GLS1_LC8G2D3T_POSITION                         0x5
#define _CLC8GLS1_LC8G2D3T_SIZE                             0x1
#define _CLC8GLS1_LC8G2D3T_LENGTH                           0x1
#define _CLC8GLS1_LC8G2D3T_MASK                             0x20
#define _CLC8GLS1_LC8G2D4N_POSN                             0x6
#define _CLC8GLS1_LC8G2D4N_POSITION                         0x6
#define _CLC8GLS1_LC8G2D4N_SIZE                             0x1
#define _CLC8GLS1_LC8G2D4N_LENGTH                           0x1
#define _CLC8GLS1_LC8G2D4N_MASK                             0x40
#define _CLC8GLS1_LC8G2D4T_POSN                             0x7
#define _CLC8GLS1_LC8G2D4T_POSITION                         0x7
#define _CLC8GLS1_LC8G2D4T_SIZE                             0x1
#define _CLC8GLS1_LC8G2D4T_LENGTH                           0x1
#define _CLC8GLS1_LC8G2D4T_MASK                             0x80

// Register: CLC8GLS2
#define CLC8GLS2 CLC8GLS2
extern volatile unsigned char           CLC8GLS2            __at(0xE75);
#ifndef _LIB_BUILD
asm("CLC8GLS2 equ 0E75h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G3D1N                  :1;
        unsigned G3D1T                  :1;
        unsigned G3D2N                  :1;
        unsigned G3D2T                  :1;
        unsigned G3D3N                  :1;
        unsigned G3D3T                  :1;
        unsigned G3D4N                  :1;
        unsigned G3D4T                  :1;
    };
    struct {
        unsigned LC8G3D1N               :1;
        unsigned LC8G3D1T               :1;
        unsigned LC8G3D2N               :1;
        unsigned LC8G3D2T               :1;
        unsigned LC8G3D3N               :1;
        unsigned LC8G3D3T               :1;
        unsigned LC8G3D4N               :1;
        unsigned LC8G3D4T               :1;
    };
} CLC8GLS2bits_t;
