GopalSaraf/Practicals/PSDL/include/proc/pic18f26q10.h
extern volatile TXCK2PPSbits_t TXCK2PPSbits __at(0xE89);
// bitfield macros
#define _TXCK2PPS_PORT_POSN                                 0x0
#define _TXCK2PPS_PORT_POSITION                             0x0
#define _TXCK2PPS_PORT_SIZE                                 0x3
#define _TXCK2PPS_PORT_LENGTH                               0x3
#define _TXCK2PPS_PORT_MASK                                 0x7
#define _TXCK2PPS_PIN_POSN                                  0x3
#define _TXCK2PPS_PIN_POSITION                              0x3
#define _TXCK2PPS_PIN_SIZE                                  0x2
#define _TXCK2PPS_PIN_LENGTH                                0x2
#define _TXCK2PPS_PIN_MASK                                  0x18
#define _TXCK2PPS_CK2PPS0_POSN                              0x0
#define _TXCK2PPS_CK2PPS0_POSITION                          0x0
#define _TXCK2PPS_CK2PPS0_SIZE                              0x1
#define _TXCK2PPS_CK2PPS0_LENGTH                            0x1
#define _TXCK2PPS_CK2PPS0_MASK                              0x1
#define _TXCK2PPS_CK2PPS1_POSN                              0x1
#define _TXCK2PPS_CK2PPS1_POSITION                          0x1
#define _TXCK2PPS_CK2PPS1_SIZE                              0x1
#define _TXCK2PPS_CK2PPS1_LENGTH                            0x1
#define _TXCK2PPS_CK2PPS1_MASK                              0x2
#define _TXCK2PPS_CK2PPS2_POSN                              0x2
#define _TXCK2PPS_CK2PPS2_POSITION                          0x2
#define _TXCK2PPS_CK2PPS2_SIZE                              0x1
#define _TXCK2PPS_CK2PPS2_LENGTH                            0x1
#define _TXCK2PPS_CK2PPS2_MASK                              0x4
#define _TXCK2PPS_CK2PPS3_POSN                              0x3
#define _TXCK2PPS_CK2PPS3_POSITION                          0x3
#define _TXCK2PPS_CK2PPS3_SIZE                              0x1
#define _TXCK2PPS_CK2PPS3_LENGTH                            0x1
#define _TXCK2PPS_CK2PPS3_MASK                              0x8
#define _TXCK2PPS_CK2PPS4_POSN                              0x4
#define _TXCK2PPS_CK2PPS4_POSITION                          0x4
#define _TXCK2PPS_CK2PPS4_SIZE                              0x1
#define _TXCK2PPS_CK2PPS4_LENGTH                            0x1
#define _TXCK2PPS_CK2PPS4_MASK                              0x10
#define _TXCK2PPS_CK2PPS_POSN                               0x0
#define _TXCK2PPS_CK2PPS_POSITION                           0x0
#define _TXCK2PPS_CK2PPS_SIZE                               0x5
#define _TXCK2PPS_CK2PPS_LENGTH                             0x5
#define _TXCK2PPS_CK2PPS_MASK                               0x1F
typedef union {
    struct {
        unsigned PORT                   :3;
        unsigned PIN                    :2;
    };
    struct {
        unsigned CK2PPS0                :1;
        unsigned CK2PPS1                :1;
        unsigned CK2PPS2                :1;
        unsigned CK2PPS3                :1;
        unsigned CK2PPS4                :1;
    };
    struct {
        unsigned CK2PPS                 :5;
    };
} TX2PPSbits_t;
extern volatile TX2PPSbits_t TX2PPSbits __at(0xE89);
// bitfield macros
#define _TX2PPS_PORT_POSN                                   0x0
#define _TX2PPS_PORT_POSITION                               0x0
#define _TX2PPS_PORT_SIZE                                   0x3
#define _TX2PPS_PORT_LENGTH                                 0x3
#define _TX2PPS_PORT_MASK                                   0x7
#define _TX2PPS_PIN_POSN                                    0x3
#define _TX2PPS_PIN_POSITION                                0x3
#define _TX2PPS_PIN_SIZE                                    0x2
#define _TX2PPS_PIN_LENGTH                                  0x2
#define _TX2PPS_PIN_MASK                                    0x18
#define _TX2PPS_CK2PPS0_POSN                                0x0
#define _TX2PPS_CK2PPS0_POSITION                            0x0
#define _TX2PPS_CK2PPS0_SIZE                                0x1
#define _TX2PPS_CK2PPS0_LENGTH                              0x1
#define _TX2PPS_CK2PPS0_MASK                                0x1
#define _TX2PPS_CK2PPS1_POSN                                0x1
#define _TX2PPS_CK2PPS1_POSITION                            0x1
#define _TX2PPS_CK2PPS1_SIZE                                0x1
#define _TX2PPS_CK2PPS1_LENGTH                              0x1
#define _TX2PPS_CK2PPS1_MASK                                0x2
#define _TX2PPS_CK2PPS2_POSN                                0x2
#define _TX2PPS_CK2PPS2_POSITION                            0x2
#define _TX2PPS_CK2PPS2_SIZE                                0x1
#define _TX2PPS_CK2PPS2_LENGTH                              0x1
#define _TX2PPS_CK2PPS2_MASK                                0x4
#define _TX2PPS_CK2PPS3_POSN                                0x3
#define _TX2PPS_CK2PPS3_POSITION                            0x3
#define _TX2PPS_CK2PPS3_SIZE                                0x1
#define _TX2PPS_CK2PPS3_LENGTH                              0x1
#define _TX2PPS_CK2PPS3_MASK                                0x8
#define _TX2PPS_CK2PPS4_POSN                                0x4
#define _TX2PPS_CK2PPS4_POSITION                            0x4
#define _TX2PPS_CK2PPS4_SIZE                                0x1
#define _TX2PPS_CK2PPS4_LENGTH                              0x1
#define _TX2PPS_CK2PPS4_MASK                                0x10
#define _TX2PPS_CK2PPS_POSN                                 0x0
#define _TX2PPS_CK2PPS_POSITION                             0x0
#define _TX2PPS_CK2PPS_SIZE                                 0x5
#define _TX2PPS_CK2PPS_LENGTH                               0x5
#define _TX2PPS_CK2PPS_MASK                                 0x1F

// Register: SSP2CLKPPS
#define SSP2CLKPPS SSP2CLKPPS
extern volatile unsigned char           SSP2CLKPPS          __at(0xE8A);
#ifndef _LIB_BUILD
asm("SSP2CLKPPS equ 0E8Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SSP2CLKPPS0            :1;
        unsigned SSP2CLKPPS1            :1;
        unsigned SSP2CLKPPS2            :1;
        unsigned SSP2CLKPPS3            :1;
        unsigned SSP2CLKPPS4            :1;
    };
    struct {
        unsigned SSP2PPS                :5;
    };
} SSP2CLKPPSbits_t;
extern volatile SSP2CLKPPSbits_t SSP2CLKPPSbits __at(0xE8A);
// bitfield macros
#define _SSP2CLKPPS_PIN_POSN                                0x0
#define _SSP2CLKPPS_PIN_POSITION                            0x0
#define _SSP2CLKPPS_PIN_SIZE                                0x3
#define _SSP2CLKPPS_PIN_LENGTH                              0x3
#define _SSP2CLKPPS_PIN_MASK                                0x7
#define _SSP2CLKPPS_PORT_POSN                               0x3
#define _SSP2CLKPPS_PORT_POSITION                           0x3
#define _SSP2CLKPPS_PORT_SIZE                               0x2
#define _SSP2CLKPPS_PORT_LENGTH                             0x2
#define _SSP2CLKPPS_PORT_MASK                               0x18
#define _SSP2CLKPPS_SSP2CLKPPS0_POSN                        0x0
#define _SSP2CLKPPS_SSP2CLKPPS0_POSITION                    0x0
#define _SSP2CLKPPS_SSP2CLKPPS0_SIZE                        0x1
#define _SSP2CLKPPS_SSP2CLKPPS0_LENGTH                      0x1
#define _SSP2CLKPPS_SSP2CLKPPS0_MASK                        0x1
#define _SSP2CLKPPS_SSP2CLKPPS1_POSN                        0x1
#define _SSP2CLKPPS_SSP2CLKPPS1_POSITION                    0x1
#define _SSP2CLKPPS_SSP2CLKPPS1_SIZE                        0x1
#define _SSP2CLKPPS_SSP2CLKPPS1_LENGTH                      0x1
#define _SSP2CLKPPS_SSP2CLKPPS1_MASK                        0x2
#define _SSP2CLKPPS_SSP2CLKPPS2_POSN                        0x2
#define _SSP2CLKPPS_SSP2CLKPPS2_POSITION                    0x2
#define _SSP2CLKPPS_SSP2CLKPPS2_SIZE                        0x1
#define _SSP2CLKPPS_SSP2CLKPPS2_LENGTH                      0x1
#define _SSP2CLKPPS_SSP2CLKPPS2_MASK                        0x4
#define _SSP2CLKPPS_SSP2CLKPPS3_POSN                        0x3
#define _SSP2CLKPPS_SSP2CLKPPS3_POSITION                    0x3
#define _SSP2CLKPPS_SSP2CLKPPS3_SIZE                        0x1
#define _SSP2CLKPPS_SSP2CLKPPS3_LENGTH                      0x1
#define _SSP2CLKPPS_SSP2CLKPPS3_MASK                        0x8
#define _SSP2CLKPPS_SSP2CLKPPS4_POSN                        0x4
#define _SSP2CLKPPS_SSP2CLKPPS4_POSITION                    0x4
#define _SSP2CLKPPS_SSP2CLKPPS4_SIZE                        0x1
#define _SSP2CLKPPS_SSP2CLKPPS4_LENGTH                      0x1
#define _SSP2CLKPPS_SSP2CLKPPS4_MASK                        0x10
#define _SSP2CLKPPS_SSP2PPS_POSN                            0x0
#define _SSP2CLKPPS_SSP2PPS_POSITION                        0x0
#define _SSP2CLKPPS_SSP2PPS_SIZE                            0x5
#define _SSP2CLKPPS_SSP2PPS_LENGTH                          0x5
#define _SSP2CLKPPS_SSP2PPS_MASK                            0x1F

// Register: SSP2DATPPS
#define SSP2DATPPS SSP2DATPPS
extern volatile unsigned char           SSP2DATPPS          __at(0xE8B);
#ifndef _LIB_BUILD
asm("SSP2DATPPS equ 0E8Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SSP2DATPPS0            :1;
        unsigned SSP2DATPPS1            :1;
        unsigned SSP2DATPPS2            :1;
        unsigned SSP2DATPPS3            :1;
        unsigned SSP2DATPPS4            :1;
    };
    struct {
        unsigned SSP2DATPPS             :5;
    };
} SSP2DATPPSbits_t;
extern volatile SSP2DATPPSbits_t SSP2DATPPSbits __at(0xE8B);
// bitfield macros
#define _SSP2DATPPS_PIN_POSN                                0x0
#define _SSP2DATPPS_PIN_POSITION                            0x0
#define _SSP2DATPPS_PIN_SIZE                                0x3
#define _SSP2DATPPS_PIN_LENGTH                              0x3
#define _SSP2DATPPS_PIN_MASK                                0x7
#define _SSP2DATPPS_PORT_POSN                               0x3
#define _SSP2DATPPS_PORT_POSITION                           0x3
#define _SSP2DATPPS_PORT_SIZE                               0x2
#define _SSP2DATPPS_PORT_LENGTH                             0x2
#define _SSP2DATPPS_PORT_MASK                               0x18
#define _SSP2DATPPS_SSP2DATPPS0_POSN                        0x0
#define _SSP2DATPPS_SSP2DATPPS0_POSITION                    0x0
#define _SSP2DATPPS_SSP2DATPPS0_SIZE                        0x1
#define _SSP2DATPPS_SSP2DATPPS0_LENGTH                      0x1
#define _SSP2DATPPS_SSP2DATPPS0_MASK                        0x1
#define _SSP2DATPPS_SSP2DATPPS1_POSN                        0x1
#define _SSP2DATPPS_SSP2DATPPS1_POSITION                    0x1
#define _SSP2DATPPS_SSP2DATPPS1_SIZE                        0x1
#define _SSP2DATPPS_SSP2DATPPS1_LENGTH                      0x1
#define _SSP2DATPPS_SSP2DATPPS1_MASK                        0x2
#define _SSP2DATPPS_SSP2DATPPS2_POSN                        0x2
#define _SSP2DATPPS_SSP2DATPPS2_POSITION                    0x2
#define _SSP2DATPPS_SSP2DATPPS2_SIZE                        0x1
#define _SSP2DATPPS_SSP2DATPPS2_LENGTH                      0x1
#define _SSP2DATPPS_SSP2DATPPS2_MASK                        0x4
#define _SSP2DATPPS_SSP2DATPPS3_POSN                        0x3
#define _SSP2DATPPS_SSP2DATPPS3_POSITION                    0x3
#define _SSP2DATPPS_SSP2DATPPS3_SIZE                        0x1
#define _SSP2DATPPS_SSP2DATPPS3_LENGTH                      0x1
#define _SSP2DATPPS_SSP2DATPPS3_MASK                        0x8
#define _SSP2DATPPS_SSP2DATPPS4_POSN                        0x4
#define _SSP2DATPPS_SSP2DATPPS4_POSITION                    0x4
#define _SSP2DATPPS_SSP2DATPPS4_SIZE                        0x1
#define _SSP2DATPPS_SSP2DATPPS4_LENGTH                      0x1
#define _SSP2DATPPS_SSP2DATPPS4_MASK                        0x10
#define _SSP2DATPPS_SSP2DATPPS_POSN                         0x0
#define _SSP2DATPPS_SSP2DATPPS_POSITION                     0x0
#define _SSP2DATPPS_SSP2DATPPS_SIZE                         0x5
#define _SSP2DATPPS_SSP2DATPPS_LENGTH                       0x5
#define _SSP2DATPPS_SSP2DATPPS_MASK                         0x1F

// Register: SSP2SSPPS
#define SSP2SSPPS SSP2SSPPS
extern volatile unsigned char           SSP2SSPPS           __at(0xE8C);
#ifndef _LIB_BUILD
asm("SSP2SSPPS equ 0E8Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SSP2SSPPS0             :1;
        unsigned SSP2SSPPS1             :1;
        unsigned SSP2SSPPS2             :1;
        unsigned SSP2SSPPS3             :1;
        unsigned SSP2SSPPS4             :1;
    };
    struct {
        unsigned SSP2SSPPS              :5;
    };
} SSP2SSPPSbits_t;
extern volatile SSP2SSPPSbits_t SSP2SSPPSbits __at(0xE8C);
// bitfield macros
#define _SSP2SSPPS_PIN_POSN                                 0x0
#define _SSP2SSPPS_PIN_POSITION                             0x0
#define _SSP2SSPPS_PIN_SIZE                                 0x3
#define _SSP2SSPPS_PIN_LENGTH                               0x3
#define _SSP2SSPPS_PIN_MASK                                 0x7
#define _SSP2SSPPS_PORT_POSN                                0x3
#define _SSP2SSPPS_PORT_POSITION                            0x3
#define _SSP2SSPPS_PORT_SIZE                                0x2
#define _SSP2SSPPS_PORT_LENGTH                              0x2
#define _SSP2SSPPS_PORT_MASK                                0x18
#define _SSP2SSPPS_SSP2SSPPS0_POSN                          0x0
#define _SSP2SSPPS_SSP2SSPPS0_POSITION                      0x0
#define _SSP2SSPPS_SSP2SSPPS0_SIZE                          0x1
#define _SSP2SSPPS_SSP2SSPPS0_LENGTH                        0x1
#define _SSP2SSPPS_SSP2SSPPS0_MASK                          0x1
#define _SSP2SSPPS_SSP2SSPPS1_POSN                          0x1
#define _SSP2SSPPS_SSP2SSPPS1_POSITION                      0x1
#define _SSP2SSPPS_SSP2SSPPS1_SIZE                          0x1
#define _SSP2SSPPS_SSP2SSPPS1_LENGTH                        0x1
#define _SSP2SSPPS_SSP2SSPPS1_MASK                          0x2
#define _SSP2SSPPS_SSP2SSPPS2_POSN                          0x2
#define _SSP2SSPPS_SSP2SSPPS2_POSITION                      0x2
#define _SSP2SSPPS_SSP2SSPPS2_SIZE                          0x1
#define _SSP2SSPPS_SSP2SSPPS2_LENGTH                        0x1
#define _SSP2SSPPS_SSP2SSPPS2_MASK                          0x4
#define _SSP2SSPPS_SSP2SSPPS3_POSN                          0x3
#define _SSP2SSPPS_SSP2SSPPS3_POSITION                      0x3
#define _SSP2SSPPS_SSP2SSPPS3_SIZE                          0x1
#define _SSP2SSPPS_SSP2SSPPS3_LENGTH                        0x1
#define _SSP2SSPPS_SSP2SSPPS3_MASK                          0x8
#define _SSP2SSPPS_SSP2SSPPS4_POSN                          0x4
#define _SSP2SSPPS_SSP2SSPPS4_POSITION                      0x4
#define _SSP2SSPPS_SSP2SSPPS4_SIZE                          0x1
#define _SSP2SSPPS_SSP2SSPPS4_LENGTH                        0x1
#define _SSP2SSPPS_SSP2SSPPS4_MASK                          0x10
#define _SSP2SSPPS_SSP2SSPPS_POSN                           0x0
#define _SSP2SSPPS_SSP2SSPPS_POSITION                       0x0
#define _SSP2SSPPS_SSP2SSPPS_SIZE                           0x5
#define _SSP2SSPPS_SSP2SSPPS_LENGTH                         0x5
#define _SSP2SSPPS_SSP2SSPPS_MASK                           0x1F

// Register: SSP2BUF
#define SSP2BUF SSP2BUF
extern volatile unsigned char           SSP2BUF             __at(0xE8D);
#ifndef _LIB_BUILD
asm("SSP2BUF equ 0E8Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSPBUF                 :8;
    };
} SSP2BUFbits_t;
extern volatile SSP2BUFbits_t SSP2BUFbits __at(0xE8D);
// bitfield macros
#define _SSP2BUF_SSPBUF_POSN                                0x0
#define _SSP2BUF_SSPBUF_POSITION                            0x0
#define _SSP2BUF_SSPBUF_SIZE                                0x8
#define _SSP2BUF_SSPBUF_LENGTH                              0x8
#define _SSP2BUF_SSPBUF_MASK                                0xFF

// Register: SSP2ADD
#define SSP2ADD SSP2ADD
extern volatile unsigned char           SSP2ADD             __at(0xE8E);
#ifndef _LIB_BUILD
asm("SSP2ADD equ 0E8Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSPADD                 :8;
    };
    struct {
        unsigned MSK0                   :1;
        unsigned MSK1                   :1;
        unsigned MSK2                   :1;
        unsigned MSK3                   :1;
        unsigned MSK4                   :1;
        unsigned MSK5                   :1;
        unsigned MSK6                   :1;
        unsigned MSK7                   :1;
    };
    struct {
        unsigned MSK02                  :1;
        unsigned MSK12                  :1;
        unsigned MSK22                  :1;
        unsigned MSK32                  :1;
        unsigned MSK42                  :1;
        unsigned MSK52                  :1;
        unsigned MSK62                  :1;
        unsigned MSK72                  :1;
    };
} SSP2ADDbits_t;
