GopalSaraf/Practicals/PSDL/include/proc/pic18f26q10.h
extern volatile T6CLKCONbits_t T6CLKCONbits __at(0xFB2);
// bitfield macros
#define _T6CLKCON_CS_POSN                                   0x0
#define _T6CLKCON_CS_POSITION                               0x0
#define _T6CLKCON_CS_SIZE                                   0x4
#define _T6CLKCON_CS_LENGTH                                 0x4
#define _T6CLKCON_CS_MASK                                   0xF
#define _T6CLKCON_CS0_POSN                                  0x0
#define _T6CLKCON_CS0_POSITION                              0x0
#define _T6CLKCON_CS0_SIZE                                  0x1
#define _T6CLKCON_CS0_LENGTH                                0x1
#define _T6CLKCON_CS0_MASK                                  0x1
#define _T6CLKCON_CS1_POSN                                  0x1
#define _T6CLKCON_CS1_POSITION                              0x1
#define _T6CLKCON_CS1_SIZE                                  0x1
#define _T6CLKCON_CS1_LENGTH                                0x1
#define _T6CLKCON_CS1_MASK                                  0x2
#define _T6CLKCON_CS2_POSN                                  0x2
#define _T6CLKCON_CS2_POSITION                              0x2
#define _T6CLKCON_CS2_SIZE                                  0x1
#define _T6CLKCON_CS2_LENGTH                                0x1
#define _T6CLKCON_CS2_MASK                                  0x4
#define _T6CLKCON_CS3_POSN                                  0x3
#define _T6CLKCON_CS3_POSITION                              0x3
#define _T6CLKCON_CS3_SIZE                                  0x1
#define _T6CLKCON_CS3_LENGTH                                0x1
#define _T6CLKCON_CS3_MASK                                  0x8
#define _T6CLKCON_T6CS_POSN                                 0x0
#define _T6CLKCON_T6CS_POSITION                             0x0
#define _T6CLKCON_T6CS_SIZE                                 0x4
#define _T6CLKCON_T6CS_LENGTH                               0x4
#define _T6CLKCON_T6CS_MASK                                 0xF
#define _T6CLKCON_T6CS0_POSN                                0x0
#define _T6CLKCON_T6CS0_POSITION                            0x0
#define _T6CLKCON_T6CS0_SIZE                                0x1
#define _T6CLKCON_T6CS0_LENGTH                              0x1
#define _T6CLKCON_T6CS0_MASK                                0x1
#define _T6CLKCON_T6CS1_POSN                                0x1
#define _T6CLKCON_T6CS1_POSITION                            0x1
#define _T6CLKCON_T6CS1_SIZE                                0x1
#define _T6CLKCON_T6CS1_LENGTH                              0x1
#define _T6CLKCON_T6CS1_MASK                                0x2
#define _T6CLKCON_T6CS2_POSN                                0x2
#define _T6CLKCON_T6CS2_POSITION                            0x2
#define _T6CLKCON_T6CS2_SIZE                                0x1
#define _T6CLKCON_T6CS2_LENGTH                              0x1
#define _T6CLKCON_T6CS2_MASK                                0x4
#define _T6CLKCON_T6CS3_POSN                                0x3
#define _T6CLKCON_T6CS3_POSITION                            0x3
#define _T6CLKCON_T6CS3_SIZE                                0x1
#define _T6CLKCON_T6CS3_LENGTH                              0x1
#define _T6CLKCON_T6CS3_MASK                                0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned CS                     :4;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned CS2                    :1;
        unsigned CS3                    :1;
    };
    struct {
        unsigned T6CS                   :4;
    };
    struct {
        unsigned T6CS0                  :1;
        unsigned T6CS1                  :1;
        unsigned T6CS2                  :1;
        unsigned T6CS3                  :1;
    };
} T6CLKbits_t;
extern volatile T6CLKbits_t T6CLKbits __at(0xFB2);
// bitfield macros
#define _T6CLK_CS_POSN                                      0x0
#define _T6CLK_CS_POSITION                                  0x0
#define _T6CLK_CS_SIZE                                      0x4
#define _T6CLK_CS_LENGTH                                    0x4
#define _T6CLK_CS_MASK                                      0xF
#define _T6CLK_CS0_POSN                                     0x0
#define _T6CLK_CS0_POSITION                                 0x0
#define _T6CLK_CS0_SIZE                                     0x1
#define _T6CLK_CS0_LENGTH                                   0x1
#define _T6CLK_CS0_MASK                                     0x1
#define _T6CLK_CS1_POSN                                     0x1
#define _T6CLK_CS1_POSITION                                 0x1
#define _T6CLK_CS1_SIZE                                     0x1
#define _T6CLK_CS1_LENGTH                                   0x1
#define _T6CLK_CS1_MASK                                     0x2
#define _T6CLK_CS2_POSN                                     0x2
#define _T6CLK_CS2_POSITION                                 0x2
#define _T6CLK_CS2_SIZE                                     0x1
#define _T6CLK_CS2_LENGTH                                   0x1
#define _T6CLK_CS2_MASK                                     0x4
#define _T6CLK_CS3_POSN                                     0x3
#define _T6CLK_CS3_POSITION                                 0x3
#define _T6CLK_CS3_SIZE                                     0x1
#define _T6CLK_CS3_LENGTH                                   0x1
#define _T6CLK_CS3_MASK                                     0x8
#define _T6CLK_T6CS_POSN                                    0x0
#define _T6CLK_T6CS_POSITION                                0x0
#define _T6CLK_T6CS_SIZE                                    0x4
#define _T6CLK_T6CS_LENGTH                                  0x4
#define _T6CLK_T6CS_MASK                                    0xF
#define _T6CLK_T6CS0_POSN                                   0x0
#define _T6CLK_T6CS0_POSITION                               0x0
#define _T6CLK_T6CS0_SIZE                                   0x1
#define _T6CLK_T6CS0_LENGTH                                 0x1
#define _T6CLK_T6CS0_MASK                                   0x1
#define _T6CLK_T6CS1_POSN                                   0x1
#define _T6CLK_T6CS1_POSITION                               0x1
#define _T6CLK_T6CS1_SIZE                                   0x1
#define _T6CLK_T6CS1_LENGTH                                 0x1
#define _T6CLK_T6CS1_MASK                                   0x2
#define _T6CLK_T6CS2_POSN                                   0x2
#define _T6CLK_T6CS2_POSITION                               0x2
#define _T6CLK_T6CS2_SIZE                                   0x1
#define _T6CLK_T6CS2_LENGTH                                 0x1
#define _T6CLK_T6CS2_MASK                                   0x4
#define _T6CLK_T6CS3_POSN                                   0x3
#define _T6CLK_T6CS3_POSITION                               0x3
#define _T6CLK_T6CS3_SIZE                                   0x1
#define _T6CLK_T6CS3_LENGTH                                 0x1
#define _T6CLK_T6CS3_MASK                                   0x8

// Register: T6RST
#define T6RST T6RST
extern volatile unsigned char           T6RST               __at(0xFB3);
#ifndef _LIB_BUILD
asm("T6RST equ 0FB3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RSEL                   :5;
    };
    struct {
        unsigned RSEL0                  :1;
        unsigned RSEL1                  :1;
        unsigned RSEL2                  :1;
        unsigned RSEL3                  :1;
        unsigned RSEL4                  :1;
    };
    struct {
        unsigned T6RSEL                 :5;
    };
    struct {
        unsigned T6RSEL0                :1;
        unsigned T6RSEL1                :1;
        unsigned T6RSEL2                :1;
        unsigned T6RSEL3                :1;
        unsigned T6RSEL4                :1;
    };
} T6RSTbits_t;
