GopalSaraf/Practicals/PSDL/include/proc/pic18f26q10.h
#define                                 INLVLA0_bit         _BIT_ACCESS(INLVLA,0)
// INLVLA<INLVLA1>
extern volatile __bit                   INLVLA1             __at(0x7841);	// @ (0xF08 * 8 + 1)
#define                                 INLVLA1_bit         _BIT_ACCESS(INLVLA,1)
// INLVLA<INLVLA2>
extern volatile __bit                   INLVLA2             __at(0x7842);	// @ (0xF08 * 8 + 2)
#define                                 INLVLA2_bit         _BIT_ACCESS(INLVLA,2)
// INLVLA<INLVLA3>
extern volatile __bit                   INLVLA3             __at(0x7843);	// @ (0xF08 * 8 + 3)
#define                                 INLVLA3_bit         _BIT_ACCESS(INLVLA,3)
// INLVLA<INLVLA4>
extern volatile __bit                   INLVLA4             __at(0x7844);	// @ (0xF08 * 8 + 4)
#define                                 INLVLA4_bit         _BIT_ACCESS(INLVLA,4)
// INLVLA<INLVLA5>
extern volatile __bit                   INLVLA5             __at(0x7845);	// @ (0xF08 * 8 + 5)
#define                                 INLVLA5_bit         _BIT_ACCESS(INLVLA,5)
// INLVLA<INLVLA6>
extern volatile __bit                   INLVLA6             __at(0x7846);	// @ (0xF08 * 8 + 6)
#define                                 INLVLA6_bit         _BIT_ACCESS(INLVLA,6)
// INLVLA<INLVLA7>
extern volatile __bit                   INLVLA7             __at(0x7847);	// @ (0xF08 * 8 + 7)
#define                                 INLVLA7_bit         _BIT_ACCESS(INLVLA,7)
// INLVLB<INLVLB0>
extern volatile __bit                   INLVLB0             __at(0x7880);	// @ (0xF10 * 8 + 0)
#define                                 INLVLB0_bit         _BIT_ACCESS(INLVLB,0)
// INLVLB<INLVLB1>
extern volatile __bit                   INLVLB1             __at(0x7881);	// @ (0xF10 * 8 + 1)
#define                                 INLVLB1_bit         _BIT_ACCESS(INLVLB,1)
// INLVLB<INLVLB2>
extern volatile __bit                   INLVLB2             __at(0x7882);	// @ (0xF10 * 8 + 2)
#define                                 INLVLB2_bit         _BIT_ACCESS(INLVLB,2)
// INLVLB<INLVLB3>
extern volatile __bit                   INLVLB3             __at(0x7883);	// @ (0xF10 * 8 + 3)
#define                                 INLVLB3_bit         _BIT_ACCESS(INLVLB,3)
// INLVLB<INLVLB4>
extern volatile __bit                   INLVLB4             __at(0x7884);	// @ (0xF10 * 8 + 4)
#define                                 INLVLB4_bit         _BIT_ACCESS(INLVLB,4)
// INLVLB<INLVLB5>
extern volatile __bit                   INLVLB5             __at(0x7885);	// @ (0xF10 * 8 + 5)
#define                                 INLVLB5_bit         _BIT_ACCESS(INLVLB,5)
// INLVLB<INLVLB6>
extern volatile __bit                   INLVLB6             __at(0x7886);	// @ (0xF10 * 8 + 6)
#define                                 INLVLB6_bit         _BIT_ACCESS(INLVLB,6)
// INLVLB<INLVLB7>
extern volatile __bit                   INLVLB7             __at(0x7887);	// @ (0xF10 * 8 + 7)
#define                                 INLVLB7_bit         _BIT_ACCESS(INLVLB,7)
// INLVLC<INLVLC0>
extern volatile __bit                   INLVLC0             __at(0x78C0);	// @ (0xF18 * 8 + 0)
#define                                 INLVLC0_bit         _BIT_ACCESS(INLVLC,0)
// INLVLC<INLVLC1>
extern volatile __bit                   INLVLC1             __at(0x78C1);	// @ (0xF18 * 8 + 1)
#define                                 INLVLC1_bit         _BIT_ACCESS(INLVLC,1)
// INLVLC<INLVLC2>
extern volatile __bit                   INLVLC2             __at(0x78C2);	// @ (0xF18 * 8 + 2)
#define                                 INLVLC2_bit         _BIT_ACCESS(INLVLC,2)
// INLVLC<INLVLC3>
extern volatile __bit                   INLVLC3             __at(0x78C3);	// @ (0xF18 * 8 + 3)
#define                                 INLVLC3_bit         _BIT_ACCESS(INLVLC,3)
// INLVLC<INLVLC4>
extern volatile __bit                   INLVLC4             __at(0x78C4);	// @ (0xF18 * 8 + 4)
#define                                 INLVLC4_bit         _BIT_ACCESS(INLVLC,4)
// INLVLC<INLVLC5>
extern volatile __bit                   INLVLC5             __at(0x78C5);	// @ (0xF18 * 8 + 5)
#define                                 INLVLC5_bit         _BIT_ACCESS(INLVLC,5)
// INLVLC<INLVLC6>
extern volatile __bit                   INLVLC6             __at(0x78C6);	// @ (0xF18 * 8 + 6)
#define                                 INLVLC6_bit         _BIT_ACCESS(INLVLC,6)
// INLVLC<INLVLC7>
extern volatile __bit                   INLVLC7             __at(0x78C7);	// @ (0xF18 * 8 + 7)
#define                                 INLVLC7_bit         _BIT_ACCESS(INLVLC,7)
// INLVLE<INLVLE3>
extern volatile __bit                   INLVLE3             __at(0x792B);	// @ (0xF25 * 8 + 3)
#define                                 INLVLE3_bit         _BIT_ACCESS(INLVLE,3)
// INTCON<INT0EDG>
extern volatile __bit                   INT0EDG             __at(0x7F90);	// @ (0xFF2 * 8 + 0)
#define                                 INT0EDG_bit         _BIT_ACCESS(INTCON,0)
// PIE0<INT0IE>
extern volatile __bit                   INT0IE              __at(0x75E8);	// @ (0xEBD * 8 + 0)
#define                                 INT0IE_bit          _BIT_ACCESS(PIE0,0)
// PIR0<INT0IF>
extern volatile __bit                   INT0IF              __at(0x7628);	// @ (0xEC5 * 8 + 0)
#define                                 INT0IF_bit          _BIT_ACCESS(PIR0,0)
// IPR0<INT0IP>
extern volatile __bit                   INT0IP              __at(0x75A8);	// @ (0xEB5 * 8 + 0)
#define                                 INT0IP_bit          _BIT_ACCESS(IPR0,0)
// INT0PPS<INT0PPS0>
extern volatile __bit                   INT0PPS0            __at(0x74E0);	// @ (0xE9C * 8 + 0)
#define                                 INT0PPS0_bit        _BIT_ACCESS(INT0PPS,0)
// INT0PPS<INT0PPS1>
extern volatile __bit                   INT0PPS1            __at(0x74E1);	// @ (0xE9C * 8 + 1)
#define                                 INT0PPS1_bit        _BIT_ACCESS(INT0PPS,1)
// INT0PPS<INT0PPS2>
extern volatile __bit                   INT0PPS2            __at(0x74E2);	// @ (0xE9C * 8 + 2)
#define                                 INT0PPS2_bit        _BIT_ACCESS(INT0PPS,2)
// INT0PPS<INT0PPS3>
extern volatile __bit                   INT0PPS3            __at(0x74E3);	// @ (0xE9C * 8 + 3)
#define                                 INT0PPS3_bit        _BIT_ACCESS(INT0PPS,3)
// INTCON<INT1EDG>
extern volatile __bit                   INT1EDG             __at(0x7F91);	// @ (0xFF2 * 8 + 1)
#define                                 INT1EDG_bit         _BIT_ACCESS(INTCON,1)
// PIE0<INT1IE>
extern volatile __bit                   INT1IE              __at(0x75E9);	// @ (0xEBD * 8 + 1)
#define                                 INT1IE_bit          _BIT_ACCESS(PIE0,1)
// PIR0<INT1IF>
extern volatile __bit                   INT1IF              __at(0x7629);	// @ (0xEC5 * 8 + 1)
#define                                 INT1IF_bit          _BIT_ACCESS(PIR0,1)
// IPR0<INT1IP>
extern volatile __bit                   INT1IP              __at(0x75A9);	// @ (0xEB5 * 8 + 1)
#define                                 INT1IP_bit          _BIT_ACCESS(IPR0,1)
// INT1PPS<INT1PPS0>
extern volatile __bit                   INT1PPS0            __at(0x74E8);	// @ (0xE9D * 8 + 0)
#define                                 INT1PPS0_bit        _BIT_ACCESS(INT1PPS,0)
// INT1PPS<INT1PPS1>
extern volatile __bit                   INT1PPS1            __at(0x74E9);	// @ (0xE9D * 8 + 1)
#define                                 INT1PPS1_bit        _BIT_ACCESS(INT1PPS,1)
// INT1PPS<INT1PPS2>
extern volatile __bit                   INT1PPS2            __at(0x74EA);	// @ (0xE9D * 8 + 2)
#define                                 INT1PPS2_bit        _BIT_ACCESS(INT1PPS,2)
// INT1PPS<INT1PPS3>
extern volatile __bit                   INT1PPS3            __at(0x74EB);	// @ (0xE9D * 8 + 3)
#define                                 INT1PPS3_bit        _BIT_ACCESS(INT1PPS,3)
// INTCON<INT2EDG>
extern volatile __bit                   INT2EDG             __at(0x7F92);	// @ (0xFF2 * 8 + 2)
#define                                 INT2EDG_bit         _BIT_ACCESS(INTCON,2)
// PIE0<INT2IE>
extern volatile __bit                   INT2IE              __at(0x75EA);	// @ (0xEBD * 8 + 2)
#define                                 INT2IE_bit          _BIT_ACCESS(PIE0,2)
// PIR0<INT2IF>
extern volatile __bit                   INT2IF              __at(0x762A);	// @ (0xEC5 * 8 + 2)
#define                                 INT2IF_bit          _BIT_ACCESS(PIR0,2)
// IPR0<INT2IP>
extern volatile __bit                   INT2IP              __at(0x75AA);	// @ (0xEB5 * 8 + 2)
#define                                 INT2IP_bit          _BIT_ACCESS(IPR0,2)
// INT2PPS<INT2PPS0>
extern volatile __bit                   INT2PPS0            __at(0x74F0);	// @ (0xE9E * 8 + 0)
#define                                 INT2PPS0_bit        _BIT_ACCESS(INT2PPS,0)
// INT2PPS<INT2PPS1>
extern volatile __bit                   INT2PPS1            __at(0x74F1);	// @ (0xE9E * 8 + 1)
#define                                 INT2PPS1_bit        _BIT_ACCESS(INT2PPS,1)
// INT2PPS<INT2PPS2>
extern volatile __bit                   INT2PPS2            __at(0x74F2);	// @ (0xE9E * 8 + 2)
#define                                 INT2PPS2_bit        _BIT_ACCESS(INT2PPS,2)
// INT2PPS<INT2PPS3>
extern volatile __bit                   INT2PPS3            __at(0x74F3);	// @ (0xE9E * 8 + 3)
#define                                 INT2PPS3_bit        _BIT_ACCESS(INT2PPS,3)
// HLVDCON0<INTH>
extern volatile __bit                   INTH                __at(0x7951);	// @ (0xF2A * 8 + 1)
#define                                 INTH_bit            _BIT_ACCESS(HLVDCON0,1)
// HLVDCON0<INTL>
extern volatile __bit                   INTL                __at(0x7950);	// @ (0xF2A * 8 + 0)
#define                                 INTL_bit            _BIT_ACCESS(HLVDCON0,0)
// SCANCON0<INTM>
extern volatile __bit                   INTM                __at(0x7A53);	// @ (0xF4A * 8 + 3)
#define                                 INTM_bit            _BIT_ACCESS(SCANCON0,3)
// SCANCON0<INVALID>
extern volatile __bit                   INVALID             __at(0x7A54);	// @ (0xF4A * 8 + 4)
#define                                 INVALID_bit         _BIT_ACCESS(SCANCON0,4)
// IOCAF<IOCAF0>
extern volatile __bit                   IOCAF0              __at(0x7828);	// @ (0xF05 * 8 + 0)
#define                                 IOCAF0_bit          _BIT_ACCESS(IOCAF,0)
// IOCAF<IOCAF1>
extern volatile __bit                   IOCAF1              __at(0x7829);	// @ (0xF05 * 8 + 1)
#define                                 IOCAF1_bit          _BIT_ACCESS(IOCAF,1)
// IOCAF<IOCAF2>
extern volatile __bit                   IOCAF2              __at(0x782A);	// @ (0xF05 * 8 + 2)
#define                                 IOCAF2_bit          _BIT_ACCESS(IOCAF,2)
// IOCAF<IOCAF3>
extern volatile __bit                   IOCAF3              __at(0x782B);	// @ (0xF05 * 8 + 3)
#define                                 IOCAF3_bit          _BIT_ACCESS(IOCAF,3)
// IOCAF<IOCAF4>
extern volatile __bit                   IOCAF4              __at(0x782C);	// @ (0xF05 * 8 + 4)
#define                                 IOCAF4_bit          _BIT_ACCESS(IOCAF,4)
// IOCAF<IOCAF5>
extern volatile __bit                   IOCAF5              __at(0x782D);	// @ (0xF05 * 8 + 5)
#define                                 IOCAF5_bit          _BIT_ACCESS(IOCAF,5)
// IOCAF<IOCAF6>
extern volatile __bit                   IOCAF6              __at(0x782E);	// @ (0xF05 * 8 + 6)
#define                                 IOCAF6_bit          _BIT_ACCESS(IOCAF,6)
// IOCAF<IOCAF7>
extern volatile __bit                   IOCAF7              __at(0x782F);	// @ (0xF05 * 8 + 7)
#define                                 IOCAF7_bit          _BIT_ACCESS(IOCAF,7)
// IOCAN<IOCAN0>
extern volatile __bit                   IOCAN0              __at(0x7830);	// @ (0xF06 * 8 + 0)
#define                                 IOCAN0_bit          _BIT_ACCESS(IOCAN,0)
// IOCAN<IOCAN1>
extern volatile __bit                   IOCAN1              __at(0x7831);	// @ (0xF06 * 8 + 1)
#define                                 IOCAN1_bit          _BIT_ACCESS(IOCAN,1)
// IOCAN<IOCAN2>
extern volatile __bit                   IOCAN2              __at(0x7832);	// @ (0xF06 * 8 + 2)
#define                                 IOCAN2_bit          _BIT_ACCESS(IOCAN,2)
// IOCAN<IOCAN3>
extern volatile __bit                   IOCAN3              __at(0x7833);	// @ (0xF06 * 8 + 3)
#define                                 IOCAN3_bit          _BIT_ACCESS(IOCAN,3)
// IOCAN<IOCAN4>
extern volatile __bit                   IOCAN4              __at(0x7834);	// @ (0xF06 * 8 + 4)
#define                                 IOCAN4_bit          _BIT_ACCESS(IOCAN,4)
// IOCAN<IOCAN5>
extern volatile __bit                   IOCAN5              __at(0x7835);	// @ (0xF06 * 8 + 5)
#define                                 IOCAN5_bit          _BIT_ACCESS(IOCAN,5)
// IOCAN<IOCAN6>
extern volatile __bit                   IOCAN6              __at(0x7836);	// @ (0xF06 * 8 + 6)
#define                                 IOCAN6_bit          _BIT_ACCESS(IOCAN,6)
// IOCAN<IOCAN7>
extern volatile __bit                   IOCAN7              __at(0x7837);	// @ (0xF06 * 8 + 7)
#define                                 IOCAN7_bit          _BIT_ACCESS(IOCAN,7)
// IOCAP<IOCAP0>
extern volatile __bit                   IOCAP0              __at(0x7838);	// @ (0xF07 * 8 + 0)
#define                                 IOCAP0_bit          _BIT_ACCESS(IOCAP,0)
// IOCAP<IOCAP1>
extern volatile __bit                   IOCAP1              __at(0x7839);	// @ (0xF07 * 8 + 1)
#define                                 IOCAP1_bit          _BIT_ACCESS(IOCAP,1)
// IOCAP<IOCAP2>
extern volatile __bit                   IOCAP2              __at(0x783A);	// @ (0xF07 * 8 + 2)
#define                                 IOCAP2_bit          _BIT_ACCESS(IOCAP,2)
// IOCAP<IOCAP3>
extern volatile __bit                   IOCAP3              __at(0x783B);	// @ (0xF07 * 8 + 3)
#define                                 IOCAP3_bit          _BIT_ACCESS(IOCAP,3)
// IOCAP<IOCAP4>
extern volatile __bit                   IOCAP4              __at(0x783C);	// @ (0xF07 * 8 + 4)
#define                                 IOCAP4_bit          _BIT_ACCESS(IOCAP,4)
// IOCAP<IOCAP5>
extern volatile __bit                   IOCAP5              __at(0x783D);	// @ (0xF07 * 8 + 5)
#define                                 IOCAP5_bit          _BIT_ACCESS(IOCAP,5)
// IOCAP<IOCAP6>
extern volatile __bit                   IOCAP6              __at(0x783E);	// @ (0xF07 * 8 + 6)
#define                                 IOCAP6_bit          _BIT_ACCESS(IOCAP,6)
// IOCAP<IOCAP7>
extern volatile __bit                   IOCAP7              __at(0x783F);	// @ (0xF07 * 8 + 7)
#define                                 IOCAP7_bit          _BIT_ACCESS(IOCAP,7)
// IOCBF<IOCBF0>
extern volatile __bit                   IOCBF0              __at(0x7868);	// @ (0xF0D * 8 + 0)
#define                                 IOCBF0_bit          _BIT_ACCESS(IOCBF,0)
// IOCBF<IOCBF1>
extern volatile __bit                   IOCBF1              __at(0x7869);	// @ (0xF0D * 8 + 1)
#define                                 IOCBF1_bit          _BIT_ACCESS(IOCBF,1)
// IOCBF<IOCBF2>
extern volatile __bit                   IOCBF2              __at(0x786A);	// @ (0xF0D * 8 + 2)
#define                                 IOCBF2_bit          _BIT_ACCESS(IOCBF,2)
// IOCBF<IOCBF3>
extern volatile __bit                   IOCBF3              __at(0x786B);	// @ (0xF0D * 8 + 3)
#define                                 IOCBF3_bit          _BIT_ACCESS(IOCBF,3)
// IOCBF<IOCBF4>
extern volatile __bit                   IOCBF4              __at(0x786C);	// @ (0xF0D * 8 + 4)
#define                                 IOCBF4_bit          _BIT_ACCESS(IOCBF,4)
// IOCBF<IOCBF5>
extern volatile __bit                   IOCBF5              __at(0x786D);	// @ (0xF0D * 8 + 5)
#define                                 IOCBF5_bit          _BIT_ACCESS(IOCBF,5)
// IOCBF<IOCBF6>
extern volatile __bit                   IOCBF6              __at(0x786E);	// @ (0xF0D * 8 + 6)
#define                                 IOCBF6_bit          _BIT_ACCESS(IOCBF,6)
// IOCBF<IOCBF7>
extern volatile __bit                   IOCBF7              __at(0x786F);	// @ (0xF0D * 8 + 7)
#define                                 IOCBF7_bit          _BIT_ACCESS(IOCBF,7)
// IOCBN<IOCBN0>
extern volatile __bit                   IOCBN0              __at(0x7870);	// @ (0xF0E * 8 + 0)
#define                                 IOCBN0_bit          _BIT_ACCESS(IOCBN,0)
// IOCBN<IOCBN1>
extern volatile __bit                   IOCBN1              __at(0x7871);	// @ (0xF0E * 8 + 1)
#define                                 IOCBN1_bit          _BIT_ACCESS(IOCBN,1)
// IOCBN<IOCBN2>
extern volatile __bit                   IOCBN2              __at(0x7872);	// @ (0xF0E * 8 + 2)
#define                                 IOCBN2_bit          _BIT_ACCESS(IOCBN,2)
// IOCBN<IOCBN3>
extern volatile __bit                   IOCBN3              __at(0x7873);	// @ (0xF0E * 8 + 3)
#define                                 IOCBN3_bit          _BIT_ACCESS(IOCBN,3)
// IOCBN<IOCBN4>
extern volatile __bit                   IOCBN4              __at(0x7874);	// @ (0xF0E * 8 + 4)
#define                                 IOCBN4_bit          _BIT_ACCESS(IOCBN,4)
// IOCBN<IOCBN5>
extern volatile __bit                   IOCBN5              __at(0x7875);	// @ (0xF0E * 8 + 5)
#define                                 IOCBN5_bit          _BIT_ACCESS(IOCBN,5)
// IOCBN<IOCBN6>
extern volatile __bit                   IOCBN6              __at(0x7876);	// @ (0xF0E * 8 + 6)
#define                                 IOCBN6_bit          _BIT_ACCESS(IOCBN,6)
// IOCBN<IOCBN7>
extern volatile __bit                   IOCBN7              __at(0x7877);	// @ (0xF0E * 8 + 7)
#define                                 IOCBN7_bit          _BIT_ACCESS(IOCBN,7)
// IOCBP<IOCBP0>
extern volatile __bit                   IOCBP0              __at(0x7878);	// @ (0xF0F * 8 + 0)
#define                                 IOCBP0_bit          _BIT_ACCESS(IOCBP,0)
// IOCBP<IOCBP1>
extern volatile __bit                   IOCBP1              __at(0x7879);	// @ (0xF0F * 8 + 1)
#define                                 IOCBP1_bit          _BIT_ACCESS(IOCBP,1)
// IOCBP<IOCBP2>
extern volatile __bit                   IOCBP2              __at(0x787A);	// @ (0xF0F * 8 + 2)
#define                                 IOCBP2_bit          _BIT_ACCESS(IOCBP,2)
// IOCBP<IOCBP3>
extern volatile __bit                   IOCBP3              __at(0x787B);	// @ (0xF0F * 8 + 3)
#define                                 IOCBP3_bit          _BIT_ACCESS(IOCBP,3)
// IOCBP<IOCBP4>
extern volatile __bit                   IOCBP4              __at(0x787C);	// @ (0xF0F * 8 + 4)
#define                                 IOCBP4_bit          _BIT_ACCESS(IOCBP,4)
// IOCBP<IOCBP5>
extern volatile __bit                   IOCBP5              __at(0x787D);	// @ (0xF0F * 8 + 5)
#define                                 IOCBP5_bit          _BIT_ACCESS(IOCBP,5)
// IOCBP<IOCBP6>
extern volatile __bit                   IOCBP6              __at(0x787E);	// @ (0xF0F * 8 + 6)
#define                                 IOCBP6_bit          _BIT_ACCESS(IOCBP,6)
// IOCBP<IOCBP7>
extern volatile __bit                   IOCBP7              __at(0x787F);	// @ (0xF0F * 8 + 7)
#define                                 IOCBP7_bit          _BIT_ACCESS(IOCBP,7)
// IOCCF<IOCCF0>
extern volatile __bit                   IOCCF0              __at(0x78A8);	// @ (0xF15 * 8 + 0)
#define                                 IOCCF0_bit          _BIT_ACCESS(IOCCF,0)
// IOCCF<IOCCF1>
extern volatile __bit                   IOCCF1              __at(0x78A9);	// @ (0xF15 * 8 + 1)
#define                                 IOCCF1_bit          _BIT_ACCESS(IOCCF,1)
// IOCCF<IOCCF2>
extern volatile __bit                   IOCCF2              __at(0x78AA);	// @ (0xF15 * 8 + 2)
#define                                 IOCCF2_bit          _BIT_ACCESS(IOCCF,2)
// IOCCF<IOCCF3>
extern volatile __bit                   IOCCF3              __at(0x78AB);	// @ (0xF15 * 8 + 3)
#define                                 IOCCF3_bit          _BIT_ACCESS(IOCCF,3)
// IOCCF<IOCCF4>
extern volatile __bit                   IOCCF4              __at(0x78AC);	// @ (0xF15 * 8 + 4)
#define                                 IOCCF4_bit          _BIT_ACCESS(IOCCF,4)
// IOCCF<IOCCF5>
extern volatile __bit                   IOCCF5              __at(0x78AD);	// @ (0xF15 * 8 + 5)
#define                                 IOCCF5_bit          _BIT_ACCESS(IOCCF,5)
// IOCCF<IOCCF6>
extern volatile __bit                   IOCCF6              __at(0x78AE);	// @ (0xF15 * 8 + 6)
#define                                 IOCCF6_bit          _BIT_ACCESS(IOCCF,6)
// IOCCF<IOCCF7>
extern volatile __bit                   IOCCF7              __at(0x78AF);	// @ (0xF15 * 8 + 7)
#define                                 IOCCF7_bit          _BIT_ACCESS(IOCCF,7)
// IOCCN<IOCCN0>
extern volatile __bit                   IOCCN0              __at(0x78B0);	// @ (0xF16 * 8 + 0)
#define                                 IOCCN0_bit          _BIT_ACCESS(IOCCN,0)
// IOCCN<IOCCN1>
extern volatile __bit                   IOCCN1              __at(0x78B1);	// @ (0xF16 * 8 + 1)
#define                                 IOCCN1_bit          _BIT_ACCESS(IOCCN,1)
// IOCCN<IOCCN2>
extern volatile __bit                   IOCCN2              __at(0x78B2);	// @ (0xF16 * 8 + 2)
#define                                 IOCCN2_bit          _BIT_ACCESS(IOCCN,2)
// IOCCN<IOCCN3>
extern volatile __bit                   IOCCN3              __at(0x78B3);	// @ (0xF16 * 8 + 3)
#define                                 IOCCN3_bit          _BIT_ACCESS(IOCCN,3)
// IOCCN<IOCCN4>
extern volatile __bit                   IOCCN4              __at(0x78B4);	// @ (0xF16 * 8 + 4)
#define                                 IOCCN4_bit          _BIT_ACCESS(IOCCN,4)
// IOCCN<IOCCN5>
extern volatile __bit                   IOCCN5              __at(0x78B5);	// @ (0xF16 * 8 + 5)
#define                                 IOCCN5_bit          _BIT_ACCESS(IOCCN,5)
// IOCCN<IOCCN6>
extern volatile __bit                   IOCCN6              __at(0x78B6);	// @ (0xF16 * 8 + 6)
#define                                 IOCCN6_bit          _BIT_ACCESS(IOCCN,6)
// IOCCN<IOCCN7>
extern volatile __bit                   IOCCN7              __at(0x78B7);	// @ (0xF16 * 8 + 7)
#define                                 IOCCN7_bit          _BIT_ACCESS(IOCCN,7)
// IOCCP<IOCCP0>
extern volatile __bit                   IOCCP0              __at(0x78B8);	// @ (0xF17 * 8 + 0)
#define                                 IOCCP0_bit          _BIT_ACCESS(IOCCP,0)
// IOCCP<IOCCP1>
extern volatile __bit                   IOCCP1              __at(0x78B9);	// @ (0xF17 * 8 + 1)
#define                                 IOCCP1_bit          _BIT_ACCESS(IOCCP,1)
// IOCCP<IOCCP2>
extern volatile __bit                   IOCCP2              __at(0x78BA);	// @ (0xF17 * 8 + 2)
#define                                 IOCCP2_bit          _BIT_ACCESS(IOCCP,2)
// IOCCP<IOCCP3>
extern volatile __bit                   IOCCP3              __at(0x78BB);	// @ (0xF17 * 8 + 3)
#define                                 IOCCP3_bit          _BIT_ACCESS(IOCCP,3)
// IOCCP<IOCCP4>
extern volatile __bit                   IOCCP4              __at(0x78BC);	// @ (0xF17 * 8 + 4)
#define                                 IOCCP4_bit          _BIT_ACCESS(IOCCP,4)
// IOCCP<IOCCP5>
extern volatile __bit                   IOCCP5              __at(0x78BD);	// @ (0xF17 * 8 + 5)
#define                                 IOCCP5_bit          _BIT_ACCESS(IOCCP,5)
// IOCCP<IOCCP6>
extern volatile __bit                   IOCCP6              __at(0x78BE);	// @ (0xF17 * 8 + 6)
#define                                 IOCCP6_bit          _BIT_ACCESS(IOCCP,6)
// IOCCP<IOCCP7>
